// Запитуємо користувача, загадане число
let userNumber = parseInt(prompt("Загадайте число від 1 до 100"));

// Перевірка, щоб введене число було в межах від 1 до 100
if (isNaN(userNumber) || userNumber < 1 || userNumber > 100) {
  alert("Введено неправильне число");
} else {
  // Змінні, які містять початкові значення для мінімального та максимального значень, які може вгадати комп'ютер
  let minNumber = 1;
  let maxNumber = 100;
  
  // Змінна, яка містить кількість спроб, які залишилися у комп'ютера
  let attemptsLeft = 3;
  
  // Цикл, який повторюється 3 рази (кількість спроб у комп'ютера)
  while (attemptsLeft > 0) {
    // Обчислюємо середнє значення між мінімальним та максимальним значеннями
    let guess = Math.floor((minNumber + maxNumber) / 2);
    
    // Питаємо користувача, чи вірне число загадане
    let isCorrect = confirm(`Чи ваше число ${guess}?`);
    
    // Якщо вірно вгадали, то виводимо повідомлення про успішне вгадування та завершуємо цикл
    if (isCorrect) {
      alert("Комп'ютер вгадав ваше число!");
      break;
    } else {
      // Якщо вгадали не вірно, то зменшуємо кількість спроб, та змінюємо мінімальне або максимальне значення в залежності від того, чи введене число користувача більше, чи менше за комп'ютерний варіант
      attemptsLeft--;
      
      if (userNumber > guess) {
        minNumber = guess + 1;
      } else {
        maxNumber = guess - 1;
      }
    }
  }
  
  // Якщо комп'ютер не вгадав число за 3 спроби, то виводимо повідомлення про невдачу
  if (attemptsLeft === 0) {
    alert("Комп'ютер не вгадав ваше число за 3 спроби :(");
  }
}
