// Генеруємо випадкове число від 1 до 5
let randomNum = Math.floor(Math.random() * 5) + 1;

// Запитуємо користувача про першу спробу
let guess1 = parseInt(prompt("Вгадайте число від 1 до 5 (спроба 1):"));

if (guess1 === randomNum) {
  // Якщо користувач вгадав число з першої спроби, виводимо відповідне повідомлення
  document.write(`<h1>Вітаємо! Ви вгадали число ${randomNum} з першої спроби!</h1>`);
} else {
  // Якщо користувач не вгадав з першої спроби, запитуємо його про другу спробу
  let guess2 = parseInt(prompt("Спробуйте ще раз. Вгадайте число від 1 до 5 (спроба 2):"));

  if (guess2 === randomNum) {
    // Якщо користувач вгадав число з другої спроби, виводимо відповідне повідомлення
    document.write(`<h1>Вітаємо! Ви вгадали число ${randomNum} з другої спроби!</h1>`);
  } else {
    // Якщо користувач не вгадав з другої спроби, виводимо повідомлення з правильною відповіддю
    document.write(`<h1>На жаль, ви не вгадали число. Правильна відповідь: ${randomNum}.</h1>`);
  }
}
